lvx/base/Documents/бит_ПакетЭтаповНаРаскрой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ПакетЭтаповНаРаскрой</Name>
			<Comment>ЛТ6.15</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВыгрузкиФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроизводственныеЭтапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказНаПроизводство</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроизводства</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураВыходногоИзделия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаВыходногоИзделия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заготовки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БукваРаскроя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Метраж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураГП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаГП</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыРаскроя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Documents/бит_ПакетЭтаповНаРаскрой/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если не ЗначениеЗаполнено(Объект.АдресВыгрузкиФайла) Тогда 
		ВосстановитьПоследнееЗначениеАдресВыгрузкиФайла();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
КонецПроцедуры                         

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьРеквизитовШапки();
КонецПроцедуры  	 

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ВыгрузитьВБазис(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В разработке у заказчика");
КонецПроцедуры

#КонецОбласти

#Область ШапкаДокумента

&НаКлиенте
асинх Процедура АдресВыгрузкиФайлаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    
    ДиалогВыбораФайла.Каталог = Объект.АдресВыгрузкиФайла;
    ДиалогВыбораФайла.Заголовок = "Выберите каталог";
    Результат = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	Если Результат <> Неопределено Тогда                 
		Объект.АдресВыгрузкиФайла = Результат[0];
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПоследнееЗначениеАдресВыгрузкиФайла()
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	бит_ПакетЭтаповНаРаскрой.Дата КАК Дата,
	                      |	бит_ПакетЭтаповНаРаскрой.АдресВыгрузкиФайла КАК АдресВыгрузкиФайла
	                      |ИЗ
	                      |	Документ.бит_ПакетЭтаповНаРаскрой КАК бит_ПакетЭтаповНаРаскрой
	                      |ГДЕ
	                      |	(ВЫРАЗИТЬ(бит_ПакетЭтаповНаРаскрой.АдресВыгрузкиФайла КАК СТРОКА(10))) <> """"
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Дата УБЫВ");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Объект.АдресВыгрузкиФайла = Выборка.АдресВыгрузкиФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРеквизитовШапки()
	
	ДоступностьШапки = Объект.ПроизводственныеЭтапы.Количество() = 0 Или ПользователиКлиент.ЭтоПолноправныйПользователь();
	
	Элементы.Организация.Доступность 	= ДоступностьШапки;
	Элементы.Подразделение.Доступность 	= ДоступностьШапки;
	Элементы.ВРЦ.Доступность 			= ДоступностьШапки;
	
КонецПроцедуры

#КонецОбласти

#Область СтраницаПроизводственныеЭтапы

&НаКлиенте
Процедура РассчитатьДокумент(Команда)
	
	ЗаполнитьЗаготовкиИМатериалы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводственныеЭтапыЭтапПроизводстваПриИзменении(Элемент)
	
	ПриИзмененииЭтапа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЭтапа(ТД = Неопределено)
	
	Если ТД = Неопределено Тогда
		ТД = Элементы.ПроизводственныеЭтапы.ТекущиеДанные;
	КонецЕсли;
	
	Если ТД <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТД.ЭтапПроизводства) Тогда
			СтруктураЗаполнения = ПроизводственныеЭтапыСобратьДанныеПоЭтапуНаСервере(ТД.ЭтапПроизводства); 
			ЗаполнитьЗначенияСвойств(ТД, СтруктураЗаполнения);
		Иначе
			ОчиститьДанныеСтроки(ТД);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанныеСтроки(ТД)
	
	ТД.ЗаказНаПроизводство 				= ПредопределенноеЗначение("Документ.ЗаказНаПроизводство2_2.ПустаяСсылка");
	ТД.ЭтапПроизводства 				= ПредопределенноеЗначение("Документ.ЭтапПроизводства2_2.ПустаяСсылка");
	ТД.НоменклатураВыходногоИзделия 	= ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	ТД.ХарактеристикаВыходногоИзделия 	= ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроизводственныеЭтапыСобратьДанныеПоЭтапуНаСервере(Знач ЭтапПроизводства)
	
	Структура = Новый Структура;
	Структура.Вставить("ЗаказНаПроизводство"			, ЭтапПроизводства.Распоряжение);
	Структура.Вставить("ЭтапПроизводства"				, ЭтапПроизводства);
	Структура.Вставить("НоменклатураВыходногоИзделия"	, ЭтапПроизводства.Спецификация.ОсновноеИзделиеНоменклатура);
	Структура.Вставить("ХарактеристикаВыходногоИзделия"	, ЭтапПроизводства.Спецификация.ОсновноеИзделиеХарактеристика);
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ПроизводственныеЭтапыУдалить(Команда)
	
	ТекущаяСтрока = Элементы.ПроизводственныеЭтапы.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
    СтрокаКоллекции = Объект.ПроизводственныеЭтапы.НайтиПоИдентификатору(ТекущаяСтрока.ПолучитьИдентификатор());
	Если СтрокаКоллекции <> Неопределено Тогда
		Объект.ПроизводственныеЭтапы.Удалить(СтрокаКоллекции);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводственныеЭтапыДобавить(Команда)
	
	ПФ = Новый Структура;
	ПФ.Вставить("РежимВыбора", Истина);
	ПФ.Вставить("МножественныйВыбор", Ложь);
	ПФ.Вставить("ЗакрыватьПриВыборе", Истина);
	
	Если ЗначениеЗаполнено(Объект.ВРЦ) Тогда
		// если заполнен отбор ВРЦ, то нужен отбор запросом
		НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;

		ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ПравоеЗначение = ПолучитьСписокЭтаповДляОтбора(Объект.Организация, Объект.Подразделение, Объект.ВРЦ);
		
		ПФ.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Организация) и ЗначениеЗаполнено(Объект.Подразделение) Тогда
		// если отбор по двум критериям, то надо объединить их
		НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
		
		ГруппаОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ПравоеЗначение = Объект.Организация;

		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Подразделение");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ПравоеЗначение = Объект.Подразделение;
		
		ПФ.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Организация) Тогда
		// обычный отбор по реквизиту
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Организация", Объект.Организация);
 		
		ПФ.Вставить("Отбор", ПараметрыОтбора);
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Подразделение) Тогда
		// обычный отбор по реквизиту
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Подразделение", Объект.Подразделение);
 		
		ПФ.Вставить("Отбор", ПараметрыОтбора); 
	КонецЕсли;
	
	ОповещениеОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораЭтапов", ЭтотОбъект);
	ОткрытьФорму("Документ.ЭтапПроизводства2_2.Форма.ФормаВыбора", ПФ, ЭтаФорма, УникальныйИдентификатор, , , ОповещениеОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьСписокЭтаповДляОтбора(Знач Организация, Знач Подразделение, Знач ВРЦ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭтапПроизводства2_2.Ссылка КАК ЭтапПроизводства
	               |ПОМЕСТИТЬ втЭтапПроизводства
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	               |ГДЕ
	               |	ЭтапПроизводства2_2.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ЕстьОтборПодразделение
	               |				ТОГДА ЭтапПроизводства2_2.Подразделение = &Подразделение
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ЕстьОтборОрганизация
	               |				ТОГДА ЭтапПроизводства2_2.Организация = &Организация
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);  
	Запрос.УстановитьПараметр("ЕстьОтборОрганизация", ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("ЕстьОтборПодразделение", ЗначениеЗаполнено(Подразделение));

	Если ЗначениеЗаполнено(ВРЦ) Тогда
		Запрос.Текст = Запрос.Текст + "
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЭтапПроизводства2_2ВидыРабочихЦентров.Ссылка КАК ЭтапПроизводства
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ВидыРабочихЦентров КАК ЭтапПроизводства2_2ВидыРабочихЦентров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЭтапПроизводства КАК втЭтапПроизводства
	               |		ПО ЭтапПроизводства2_2ВидыРабочихЦентров.Ссылка = втЭтапПроизводства.ЭтапПроизводства
	               |			И (ЭтапПроизводства2_2ВидыРабочихЦентров.Использовать)
	               |ГДЕ
	               |	ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра = &ВидРабочегоЦентра
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.Ссылка
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.АльтернативныеВидыРабочихЦентров КАК ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЭтапПроизводства КАК втЭтапПроизводства
	               |		ПО ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.Ссылка = втЭтапПроизводства.ЭтапПроизводства
	               |			И (ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.Использовать)
	               |ГДЕ
	               |	ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.ВидРабочегоЦентра = &ВидРабочегоЦентра
	               |";
		Запрос.УстановитьПараметр("ВидРабочегоЦентра", ВРЦ);
	Иначе
		Запрос.Текст = Запрос.Текст + "
				   |ВЫБРАТЬ
	               |	втЭтапПроизводства.ЭтапПроизводства КАК ЭтапПроизводства
	               |ИЗ
	               |	втЭтапПроизводства КАК втЭтапПроизводства";	
	КонецЕсли;
	Результат = Запрос.Выполнить().Выгрузить();
	Список = новый СписокЗначений;
	Если Результат.Количество() Тогда
		Список.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("ЭтапПроизводства"));
	КонецЕсли;

	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораЭтапов(Результат, ДопПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		Если Объект.ПроизводственныеЭтапы.НайтиСтроки(Новый Структура("ЭтапПроизводства", Результат)).Количество() = 0 Тогда
			новаяСтрока = Объект.ПроизводственныеЭтапы.Добавить();
			новаяСтрока.ЭтапПроизводства = Результат;
			ПриИзмененииЭтапа(новаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводственныеЭтапыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТД = Элементы.ПроизводственныеЭтапы.ТекущиеДанные;
	ИмяПоля = СтрЗаменить(Поле.Имя, "ПроизводственныеЭтапы", "");
	ОткрытьЗначение(ТД[ИмяПоля]);
		
КонецПроцедуры

#КонецОбласти

#Область Заготовки

&НаКлиенте
Процедура ДеревоЗаготовокБукваРаскрояПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаготовкиЗаполнитьЗаготовки(Команда)

	ЗаполнитьЗаготовкиИМатериалы();
	
КонецПроцедуры                     

&НаКлиенте
Процедура ЗаполнитьЗаготовкиИМатериалы()
	
	ЗаполнитьТЧЗаготовки();	
	ЗаполнитьДеревоЗаготовок(ДеревоЗаготовок);	
    ЗаполнитьТЧМатериалы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧЗаготовки() Экспорт 
	
	Объект.Заготовки.Очистить();	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЧЗаказыНаПроизводство", Объект.ПроизводственныеЭтапы.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧЗаказыНаПроизводство.ЗаказНаПроизводство КАК ДокЗаказНаПроизводство
	|ПОМЕСТИТЬ ВТ_ТЧЗаказыНаПроизводство
	|ИЗ
	|	&ТЧЗаказыНаПроизводство КАК ТЧЗаказыНаПроизводство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокЗаказНаПроизводство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаПроизводствоТЧПродукция.Номенклатура КАК Номенклатура,
	|	ЗаказНаПроизводствоТЧПродукция.Характеристика КАК ВариантИсполнения,
	//ПС__ 24.09.2024 Положий Виталий Вадимович
	|	ЗаказНаПроизводствоТЧПродукция.НоменклатураГП КАК НоменклатураГП,
	|	ЗаказНаПроизводствоТЧПродукция.ВариантИсполненияГП КАК ВариантИсполненияГП,
	//__ПС 24.09.2024 Положий Виталий Вадимович
	|	СУММА(ЗаказНаПроизводствоТЧПродукция.Кол) КАК Кол,
	|	ЗаказНаПроизводствоТЧПродукция.ВариантИсполнения.Раскрой_Материал.НоменклатурнаяГруппа.СвойстваМатериалаРаскроя.ВидРаскроя КАК ВидРаскроя
	|ИЗ
	|	ВТ_ТЧЗаказыНаПроизводство КАК ВТ_ТЧЗаказыНаПроизводство
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство.ТЧПродукция КАК ЗаказНаПроизводствоТЧПродукция
	|		ПО ВТ_ТЧЗаказыНаПроизводство.ДокЗаказНаПроизводство = ЗаказНаПроизводствоТЧПродукция.Ссылка
	|ГДЕ
	|	ЗаказНаПроизводствоТЧПродукция.Ссылка.ТехнологическаяОперация.ЭтоРезка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаПроизводствоТЧПродукция.Номенклатура,
	|	ЗаказНаПроизводствоТЧПродукция.ВариантИсполнения,
	//ПС__ 24.09.2024 Положий Виталий Вадимович
	|	ЗаказНаПроизводствоТЧПродукция.НоменклатураГП,
	|	ЗаказНаПроизводствоТЧПродукция.ВариантИсполненияГП,
	//__ПС 24.09.2024 Положий Виталий Вадимович
	|	ЗаказНаПроизводствоТЧПродукция.ВариантИсполнения.Раскрой_Материал.НоменклатурнаяГруппа.СвойстваМатериалаРаскроя.ВидРаскроя";
	
	Объект.Заготовки.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры // КПДеревоСоставляющиеПередатьВРаскрой()

&НаСервере
Процедура ЗаполнитьДеревоЗаготовок(ВхДерево)
		
	ВхДерево.Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЧЗаготовки", Объект.Заготовки.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧЗаготовки.Номенклатура КАК Номенклатура,
	|	ТЧЗаготовки.Характеристика КАК Характеристика,
	//ПС__ 24.09.2024 Положий Виталий Вадимович
	|	ТЧЗаготовки.НоменклатураГП КАК НоменклатураГП,
	|	ТЧЗаготовки.ХарактеристикаГП КАК ХарактеристикаГП,
	//__ПС 24.09.2024 Положий Виталий Вадимович
	|	ТЧЗаготовки.Количество КАК Количество,
	//|	ТЧЗаготовки.ВидРаскроя КАК ВидРаскроя,
	//Vardanyan 08.11.2024 >>
	|	ТЧЗаготовки.БукваРаскроя КАК БукваРаскроя
	//Vardanyan 08.11.2024 <<
	|ПОМЕСТИТЬ ВТ_ТЧЗаготовки
	|ИЗ
	|	&ТЧЗаготовки КАК ТЧЗаготовки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧЗаготовки.Номенклатура КАК Номенклатура,
	|	ВТ_ТЧЗаготовки.Характеристика КАК Характеристика,
	|	ВТ_ТЧЗаготовки.НоменклатураГП КАК НоменклатураГП,
	|	ВТ_ТЧЗаготовки.ХарактеристикаГП КАК ХарактеристикаГП,
	//|	ВТ_ТЧЗаготовки.ВидРаскроя КАК ВидРаскроя,  // Спросить
	//|	ЕСТЬNULL(СпрВариантыИсполнения.Раскрой_Материал, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Раскрой_Материал,
	|	ЕСТЬNULL(ХарактеристикиНоменклатурыДополнительныеРеквизитыВысота.Значение, 0) КАК Высота,
	|	ЕСТЬNULL(ХарактеристикиНоменклатурыДополнительныеРеквизитыШирина.Значение, 0) КАК Ширина,
	//|	ЕСТЬNULL(СпрВариантыИсполнения.Метраж, 0) * ВТ_ТЧЗаготовки.Количество КАК Метраж, // Спросить
	|0 КАК Метраж,
	|	ВТ_ТЧЗаготовки.Количество КАК Количество,
	|	ВТ_ТЧЗаготовки.БукваРаскроя КАК БукваРаскроя
	|ИЗ
	|	ВТ_ТЧЗаготовки КАК ВТ_ТЧЗаготовки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизитыВысота
	|		ПО ВТ_ТЧЗаготовки.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизитыВысота.Ссылка
	|		И ХарактеристикиНоменклатурыДополнительныеРеквизитыВысота.Свойство = &РеквизитХарактеристикиВысота
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизитыШирина
	|		ПО ВТ_ТЧЗаготовки.Характеристика = ХарактеристикиНоменклатурыДополнительныеРеквизитыШирина.Ссылка
	|		И ХарактеристикиНоменклатурыДополнительныеРеквизитыШирина.Свойство = &РеквизитХарактеристикиШирина
	|ИТОГИ
	|	МАКСИМУМ(НоменклатураГП),
	//|	МАКСИМУМ(ВидРаскроя)
	|ПО
	|	ХарактеристикаГП,
	//|	Раскрой_Материал
	|";
	
	Результат = Запрос.Выполнить();
	ВыборкаНоменклатураГП  = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ТаблНоменклатураГП = Объект.Заготовки.Выгрузить(,"НоменклатураГП,ХарактеристикаГП,БукваРаскроя");
	ТаблНоменклатураГП.Свернуть("НоменклатураГП,ХарактеристикаГП,БукваРаскроя");
	ТаблНоменклатураГП.Колонки.Добавить("Поз");
	Для Каждого СтрокаТаблНоменклатураГП Из ТаблНоменклатураГП Цикл
		Если глПустоеЗначение(СтрокаТаблНоменклатураГП.БукваРаскроя) Тогда
			СтрокаТаблНоменклатураГП.Поз = ПС_ПолучитьПозСтрока(ТаблНоменклатураГП.Индекс(СтрокаТаблНоменклатураГП)+1);
			СтрокаТаблНоменклатураГП.БукваРаскроя = СтрокаТаблНоменклатураГП.Поз;
			_Отбор = Новый Структура;
			_Отбор.Вставить("НоменклатураГП", СтрокаТаблНоменклатураГП.НоменклатураГП);
			_Отбор.Вставить("ХарактеристикаГП",СтрокаТаблНоменклатураГП.ХарактеристикаГП);
			ТЧ_Загатовки = Объект.Заготовки.НайтиСтроки(_Отбор);
			
			Для каждого Эл_Масс из ТЧ_Загатовки Цикл
				Эл_Масс.БукваРаскроя = СтрокаТаблНоменклатураГП.БукваРаскроя;	
			КонецЦикла;
			ЗаполнитьЗначенияСвойств(ТЧЗаготовки, ТЧ_Загатовки);
		Иначе
			СтрокаТаблНоменклатураГП.Поз = СтрокаТаблНоменклатураГП._Буква_Раскроя;
		КонецЕсли;
	КонецЦикла;
	
	Пока ВыборкаНоменклатураГП.Следующий() Цикл
		
		строка_ДеревоЗаготовокГП = ВхДерево.Строки.Добавить();
		строка_ДеревоЗаготовокГП.Номенклатура		= ВыборкаНоменклатураГП.НоменклатураГП;
		строка_ДеревоЗаготовокГП.Характеристика	= ВыборкаНоменклатураГП.ХарактеристикаГП;
		
		СтрокаТаблНоменклатураГП =  ТаблНоменклатураГП.Найти(ВыборкаНоменклатураГП.ХарактеристикаГП, "ХарактеристикаГП");
		Если Не СтрокаТаблНоменклатураГП = Неопределено Тогда
			строка_ДеревоЗаготовокГП.БукваРаскроя =  СтрокаТаблНоменклатураГП.Поз;
		КонецЕсли;
		
		ВыборкаМатериалРаскроя = ВыборкаНоменклатураГП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Пока ВыборкаМатериалРаскроя.Следующий() Цикл
			
			строка_ДеревоЗаготовок = строка_ДеревоЗаготовокГП.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(строка_ДеревоЗаготовок, ВыборкаМатериалРаскроя);
			строка_ДеревоЗаготовок.Номенклатура = ВыборкаМатериалРаскроя.Раскрой_Материал;
			
			ВыборкаЗаготовки = ВыборкаМатериалРаскроя.Выбрать();
			
			Пока ВыборкаЗаготовки.Следующий() Цикл
				
				строка_ДеревоЗаготовок_Заготовка = строка_ДеревоЗаготовок.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(строка_ДеревоЗаготовок_Заготовка, ВыборкаЗаготовки);	
				строка_ДеревоЗаготовок_Заготовка._Буква_Раскроя = "";

			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры // КПДеревоСоставляющиеПередатьВРаскрой()

Функция глПустоеЗначение(ВхЗначение) Экспорт

	// Сначала примитивные типы
	Если ВхЗначение = NULL 
		Тогда
		
		Возврат Истина;
		
	КонецЕсли;	

	ТипЗначения = ТипЗнч(ВхЗначение);

	Если ТипЗначения = Тип("Неопределено") Тогда
		
		Возврат ВхЗначение = Неопределено;
		
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		
		Возврат ПустаяСтрока(ВхЗначение);
		
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		
		Возврат ВхЗначение = 0;
		
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		
		Возврат Ложь; // Булево будем считать не пустым
		
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		
		Возврат ВхЗначение = '00010101'
			ИЛИ ВхЗначение = '00010101000000'; 
		
	ИначеЕсли ТипЗначения = Тип("СписокЗначений")
		ИЛИ ТипЗначения = Тип("Массив")
		ИЛИ ТипЗначения = Тип("ТаблицаЗначений")
		ИЛИ ТипЗначения = Тип("Структура")
		Тогда
		
		Возврат ВхЗначение.Количество() = 0;
		
	//Отдельное определение, так как конструкторов данного типа не существует	
	ИначеЕсли ТипЗначения = Тип("РежимПроведенияДокумента") Тогда
	
		Возврат НЕ ВхЗначение = РежимПроведенияДокумента.Неоперативный
				И НЕ ВхЗначение = РежимПроведенияДокумента.Оперативный;
		
	//Отдельное определение, так как конструкторов данного типа не существует	
	ИначеЕсли ТипЗначения = Тип("СтрокаДереваЗначений")
			ИЛИ ТипЗначения = Тип("СтрокаТаблицыЗначений")
			Тогда
			
			Возврат Ложь;
			
	//Отдельное определение, так как конструкторов данного типа не существует	
	ИначеЕсли ТипЗначения = Тип("МоментВремени")
			Тогда
			
			
			Возврат глПустоеЗначение(ВхЗначение.Дата) И глПустоеЗначение(ВхЗначение.Ссылка);
			
	// Для остальных будем считать значение пустым, если оно равно
	// дефолтному значению своего типа
	Иначе
		
		Попытка
			
			Возврат ВхЗначение = Новый(ТипЗначения);
			
		Исключение
			
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЕсли; 

КонецФункции // глПустоеЗначение()

Функция ПС_ПолучитьПозСтрока(ВхНомер) Экспорт
	
	//ПС__ 27.09.2024 Положий Виталий Вадимович
	Если ВхНомер = 0 Тогда
		Возврат ""
	КонецЕсли;
	
	//Алфавит2 = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЬЫЪЭЮЯ";
	Алфавит2 = "АБВГДЕЖЗИКЛМНОПРСТУФХЦЧШЩЭЮЯ";
    КолСимволов = СтрДлина(Алфавит2);
	
	РезСтрока = "";
	
	_Число = ВхНомер;
	
	Пока Истина Цикл

		_Кратность = Цел(_Число/КолСимволов);
		ОстатокОтДеления = _Число%КолСимволов;
		
		Если Не _Кратность = 0 И ОстатокОтДеления = 0 Тогда
			РезСтрока = "" + Сред(Алфавит2,КолСимволов, 1) + РезСтрока;
			Если _Кратность = 1 Тогда
				Возврат РезСтрока;
			Иначе
				_Кратность = _Кратность - 1;	
			КонецЕсли;
		ИначеЕсли _Кратность = 0 И Не ОстатокОтДеления = 0 Тогда
			РезСтрока = "" + Сред(Алфавит2, _Число, 1) + РезСтрока;
			Возврат РезСтрока;
		Иначе
			РезСтрока = "" + Сред(Алфавит2, ОстатокОтДеления, 1) + РезСтрока;
		КонецЕсли;
				
		_Число = _Кратность;
		
	КонецЦикла;
	
	Возврат РезСтрока;
	//__ПС 27.09.2024 Положий Виталий Вадимович
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧМатериалы() Экспорт 
	
	//Оставим материалы НЕ являющиеся материалами раскроя
	н = 0;
	Пока н < Объект.МатериалыРаскроя.Количество() Цикл
	   СтрТЧМатериалы = Объект.МатериалыРаскроя.Получить(н);
	   
	   Если СтрТЧМатериалы.Номенклатура.НоменклатурнаяГруппа.ИспользоватьВРаскрое Тогда
		   
		   Объект.МатериалыРаскроя.Удалить(н);
		   
	   Иначе
		   
		   н = н + 1;  
	   
	   КонецЕсли; 
	
	КонецЦикла; 
	
	Если ТЧРезультатРаскроя.Количество() = 0 Тогда
		
		Объект.МатериалыРаскроя.Очистить();
		
		стру_ОтборОстатков = Новый Соответствие;
		стру_ОтборОстатков.Вставить("ДокЗаказ", 				ТЧЗаказыНаПроизводство.ВыгрузитьКолонку("ДокЗаказНаПроизводство"));
		стру_ОтборОстатков.Вставить("ТехнологическаяОперация", 	ТехнологическаяОперация);
		стру_ОтборОстатков.Вставить("КолПотребность > 0");
		
		табл_ПотребностиВСырье = глПолучитьОстатки_ПотребностиВСырье(	глПолучитьМоментВремениОстатков(ЭтотОбъект), 
																		Ссылка, 
																		стру_ОтборОстатков);
		
	ИначеЕсли Есть.Раскрой() Тогда 
		
		табл_ПотребностиВСырье = ТЧРезультатРаскроя.Выгрузить();
		табл_ПотребностиВСырье.Колонки.Добавить("КолПотребность");
		табл_ПотребностиВСырье.ЗаполнитьЗначения(1, "КолПотребность");
		табл_ПотребностиВСырье.Свернуть("НоменклатураМатериалаРаскроя, ХарактеристикаМатериалаРаскроя, КодКарты, КолПотребность");
		
		табл_ПотребностиВСырье.Колонки.НоменклатураМатериалаРаскроя.Имя 		= "Номенклатура";
		табл_ПотребностиВСырье.Колонки.ВариантИсполненияМатериалаРаскроя.Имя 	= "Характеристика";
		
		
		_Параметр_ДлинаРаскроя = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.РеквизитХарактеристикиВысота, , Истина);
		_Параметр_ШиринаРаскроя = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.РеквизитХарактеристикиШирина, , Истина);
		Для Каждого Строка_ПотребностиВСырье Из табл_ПотребностиВСырье Цикл
			
			_СвойстваМатериалаРаскроя = Строка_ПотребностиВСырье.Номенклатура.НоменклатурнаяГруппа.СвойстваМатериалаРаскроя;
			Если НЕ _СвойстваМатериалаРаскроя.УчитыватьМатериалыПоРазмерам Тогда
				Раскрой_Длина 		= глПолучитьЗначениеПараметраВИ(Строка_ПотребностиВСырье.Характеристика, _Параметр_ДлинаРаскроя);
				Раскрой_Ширина 		= глПолучитьЗначениеПараметраВИ(Строка_ПотребностиВСырье.Характеристика, _Параметр_ШиринаРаскроя);
				_МетражРаскроя = глВычислитьМетражРаскрояПоРазмерам(Раскрой_Длина, Раскрой_Ширина, _СвойстваМатериалаРаскроя.ВидРаскроя);
				
				Строка_ПотребностиВСырье.КолПотребность = Строка_ПотребностиВСырье.КолПотребность * _МетражРаскроя;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого строка_ПотребностиВСырье Из табл_ПотребностиВСырье Цикл
		
		строка_ТЧМатериалы = Объект.МатериалыРаскроя.Добавить();
		строка_ТЧМатериалы.Номенклатура 	= строка_ПотребностиВСырье.Номенклатура;
		строка_ТЧМатериалы.Характеристика 	= строка_ПотребностиВСырье.ВариантИсполнения;
		строка_ТЧМатериалы.Количество 		= строка_ПотребностиВСырье.КолПотребность;
		
	КонецЦикла;
	
	Объект.МатериалыРаскроя.Свернуть("Номенклатура, Характеристика", "Количество");

КонецПроцедуры // КПДеревоСоставляющиеПередатьВРаскрой()

&НаСервереБезКонтекста
Функция глПолучитьЗначениеПараметраВИ(Характеристика, Свойство)
	
	Запрос = новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК Значение
	                      |ИЗ
	                      |	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
	                      |ГДЕ
	                      |	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка = &Ссылка
	                      |	И ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &Свойство");
	Запрос.УстановитьПараметр("Ссылка", Характеристика);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;                   
	
	Возврат Неопределено;
	
КонецФункции

 &НаСервереБезКонтекста
 Функция глВычислитьМетражРаскрояПоРазмерам(ВхДлина, ВхШирина, ВхВидРаскроя) 
	
	Возврат ЗакрытыйМодуль_УправлениеРаскроем.ВычислитьМетражРаскрояПоРазмерам(ВхДлина, ВхШирина, ВхВидРаскроя);
	
 КонецФункции

#КонецОбласти
